question_and_answer = {
    "สวัสดี": "สวัสดีครับ/ค่ะ ฉันคือแชทบอทที่ถูกออกแบบมาเพื่อช่วยเหลือคุณ",
    "คุณชื่ออะไร": "ฉันไม่มีชื่อ แต่คุณสามารถเรียกฉันว่าแชทบอทได้",
    "คุณทำอะไรได้บ้าง": "ฉันสามารถตอบคำถามทั่วไปและช่วยเหลือคุณในเรื่องต่างๆ ได้",
    "ขอบคุณ": "ยินดีครับ/ค่ะ ถ้าคุณมีคำถามเพิ่มเติม อย่าลังเลที่จะถาม",
    "ลาก่อน": "ลาก่อนครับ/ค่ะ หวังว่าจะได้พูดคุยกันอีกครั้งในอนาคต",
    "ซื้อของ": "สินค้าของเรามีดังต่อไปนี้ : \n(ก-01) น้ำยาอเนกประสงค์ 1 ลิตร ราคา 100 บาท \n(ก-02) น้ำยาล้างจาน 500 มล. ราคา 50 บาท \n(ก-03) น้ำยาปรับผ้านุ่ม 1 ลิตร ราคา 120 บาท",
    "ติดต่อเรา": "คุณสามารถติดต่อเราผ่านทางอีเมลหรือโทรศัพท์ที่ระบุไว้ในเว็บไซต์ของเรา",
    "ก-01": "น้ำยาอเนกประสงค์ 1 ลิตร ราคา 100 บาท",
    "ก-02": "น้ำยาล้างจาน 500 มล. ราคา 50 บาท",
    "ก-03": "น้ำยาปรับผ้านุ่ม 1 ลิตร ราคา 120 บาท",
}

# Get input from the user
max_round = 5
for round in range(max_round):
    user_input = input("Please enter something: ")
    user_input = user_input.strip()  # Remove leading and trailing whitespace
    if user_input in question_and_answer.keys() :
        print(question_and_answer[user_input])
    else:
        print("คำถามไม่อยู่ในฐานข้อมูลของฉัน กรุณาลองใหม่อีกครั้ง")
